<?php

//Отримати залишок від ділення 7 на 3
$a = 7;
$b = 3;
$c = $a % $b;
var_dump($c);

//Отримати цілу частину ділення 7 и 7,15

$num1 = 7.15;
$num2 = 7;
$result = (int) ($num1/$num2);
var_dump($result);

//Отримати корінь из 25

var_dump(sqrt(25));

//Отримати 4-е слово з фрази - Десять негритят пошли купаться в море

$str = 'Десять негритят пошли купаться в море';
$str2 = explode(' ', $str);
var_dump($str2[3]);

//Отримати 17-й символ із фрази - Десять негритят пошли купаться в море
var_dump($str[16]);

//зробити великою кожну першу букву слів фрази - Десять негритят пошли купаться в море

$str3 = ucwords('Десять негритят пошли купаться в море');
var_dump($str3); //Не розумію чого не переводиться в кожну велику літеру

// Порахувати длину строки - Десять негритят пошли купаться в море

var_dump(strlen($str));

//Чи вірно твердження true дорівнює 1

var_dump(true == 1);


//Чи вірно твердження false тождественно 0
var_dump(false === 0);

// Яка строка більше three - три . Чогось тут показує, що три більше.
$string1 = 'three';
$string2 = 'Три';

if ($string1 > $string2) {
    echo "Рядок '$string1' більший за рядок '$string2'.";
} elseif ($string1 < $string2) {
    echo "Рядок '$string2' більший за рядок '$string1'.";
} else {
    echo "Рядки рівні.";
}


//Яке число більше 125 умножить на 13 плюс 7 или 223 плюс 28 умножить 2

$expression1 = 125 * 13 + 7;
$expression2 = 223 + 28 * 2;

if ($expression1 > $expression2) {
    echo "Вираз 1 більший за вираз 2.";
} elseif ($expression1 < $expression2) {
    echo "Вираз 2 більший за вираз 1.";
} else {
    echo "Обидва вирази рівні.";
}